# RemoveWireSize Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingType..::..RemoveWireSize Method
TemperatureRatingType Class See Also
---
Remove an existing wire size type from this temperature rating type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void RemoveWireSize(
	WireSize wireSize
)
```

Visual Basic
---
```text
Public Sub RemoveWireSize ( _
	wireSize As WireSize _
)
```

Visual C++
---
```text
public:
void RemoveWireSize(
	WireSize^ wireSize
)
```

# ### Parameters
wireSize
    Type: Autodesk.Revit.DB.Electrical..::..WireSizeThe wire size type to be removed.
# See Also
TemperatureRatingType Class
Autodesk.Revit.DB.Electrical Namespace